package com.zsc.muqammusic.data;

import com.zsc.muqammusic.R;

public class InstruConst {
	
	public static int[] DRAWABLES = { R.drawable.sataer_icon, R.drawable.aijieke_icon,
			R.drawable.huxitaer_icon, R.drawable.tanbuer_icon, R.drawable.dutaer_icon,
			R.drawable.kashirewapu_icon, R.drawable.yilirewapu_icon, R.drawable.kalong_icon,
			R.drawable.jiang_icon, R.drawable.naiyi_icon, R.drawable.sunaiyi_icon,
			R.drawable.balaman_icon, R.drawable.dapu_icon,
			R.drawable.nagela_icon, R.drawable.sapayi_icon,
			R.drawable.tashi_icon, R.drawable.kuxiuke_icon };
	
	public static String[] ICONNAMES = { "萨它尔", "艾捷克", "胡西它尔", "弹布尔", "都它尔", "喀什热瓦普", "伊犁热瓦普", "卡龙",
			"锵", "乃依", "苏乃依", "巴拉满", "达普", "纳格拉", "萨帕依", "它石", "库修克" };

	public static final int INS_IMAGES[][] = {
		{R.drawable.sataer_1, R.drawable.sataer_1, R.drawable.sataer_3},
		{R.drawable.aijieke_1, R.drawable.aijieke_2, R.drawable.aijieke_3, R.drawable.aijieke_4},
		{R.drawable.huxitaer_1, R.drawable.huxitaer_2, R.drawable.huxitaer_3, R.drawable.huxitaer_4},
		{R.drawable.tanbuer_1, R.drawable.tanbuer_2},
		{R.drawable.dutaer_1, R.drawable.dutaer_2, R.drawable.dutaer_3},
		{R.drawable.kashirewapu_1, R.drawable.kashirewapu_2},
		{R.drawable.yilirewapu_1, R.drawable.yilirewapu_2, R.drawable.yilirewapu_3},
		{R.drawable.kalong_1, R.drawable.kalong_2,R.drawable.kalong_3,R.drawable.kalong_4},
		{R.drawable.jiang_1, R.drawable.jiang_2},
		{R.drawable.naiyi_1},
		{R.drawable.sunaiyi_1},
		{R.drawable.balaman_1, R.drawable.balaman_2},
		{R.drawable.dapu_1, R.drawable.dapu_2,R.drawable.dapu_3,R.drawable.dapu_4},
		{R.drawable.nagela_1, R.drawable.nagela_2},
		{R.drawable.sapayi_2, R.drawable.sapayi_1},
		{R.drawable.tashi_1, R.drawable.tashi_2},
		{R.drawable.kuxiuke_1}
	};
	
	private static String sataer = "维吾尔族弦鸣类弓弦乐器。通体木制，通长1380毫米左右，共鸣箱为长瓢形，由整块桑木挖槽而成。上蒙薄木板，琴码上方两侧各有新月眉状音孔一个。琴杆硕长，并嵌以骨质花纹装饰。上以丝弦缠就品味十八个，音响面板上设有五个高音品位。十至十四个音柱分别置于琴柄正面和左侧面，上拴一根金属主奏弦和九至十三根金属共鸣弦，码右侧上翘，致使主奏弦远离指板。演奏时竖直琴身于左腿之上，右手持马尾弓擦弦发声，左手按品位改变音高。主奏弦常规定音为d或c，共鸣弦的定弦法因人、因地、因曲而异。右手常用连弓、分弓和顿弓等技法。左手按弦以食指为主，兼用中指、无名指和小指，以揉、滑、颤、带等多种技法奏出四分音和游移的音乐。高音区音色尖锐，略带金属声；中音区音色明亮优美；低音区音色浑厚，略带沙哑。主奏弦音域可达两个八度以上。萨它尔是流传在南部新疆喀什、和田、莎车、库车等地的大型古典套曲十二木卡姆和流传在东部新疆吐鲁番地区的大型古典套曲吐鲁番木卡姆的主要伴奏乐器。";
	private static String aijieke = "维吾尔族弦鸣类弓弦乐器。外型别致独特，琴筒球形，木制。内侧蒙蟒皮，通过音柱与桐木板连接，使共鸣体形成两个半球形，周围有发音孔，琴托或转动，用以调整弓与弦的角度，音色具有板面振动与皮面振动相结合的效果。一般有主奏弦两条，在主奏弦的弦柱下另设有若干共鸣弦，弓用竹片张马尾而成，演奏时用弓擦奏主奏弦，其它弦起共呜作用。多见于全疆各地、州、县专业文艺表演团体，是当代维吾尔族乐队中的主要拉弦乐器，也为专业团体演出十二木卡姆、吐鲁番木卡姆时所常用。能以揉、滑、颤、带等多种技法演奏出四分音及活音。";
	private static String huxitaer = "维吾尔族弦鸣类弓弦乐器。外观与西洋弹弦乐器曼多林相似，全长68厘米，由共鸣箱、琴头、弦轴、琴颈、指板、琴马、系弦板、琴弦和琴弓等部分构成。共鸣箱呈半梨形，较为宽大，背板采用桑木或杏木制作，由六块木板拼粘而成，外形似瓢状，正面蒙以鱼鳞松薄板，琴箱长34.5厘米、最宽处17.5厘米，面板脊部呈拱形，中部两侧做弧形凹进，以便于运弓；中间开有两个出音孔，其形为对称的低音谱号。琴头、琴颈用一块木料制作，上端为琴头，长15厘米，雕刻呈百灵鸟头状，有如百灵昂首鸣唱，弦槽后开，左右两侧设有四个弦轴，正面下端设有四个弦孔和弦枕。弦轴核桃木制，呈圆锥形，轴柄为椭圆球状，四轴用以缠绕主奏弦。琴颈较短，仅长13厘米，正面胶有硬木指板，用以按弦，琴颈左侧面设有七个弦轴，用以张紧共鸣弦。面板中部置木制琴马，四条主奏弦采用小提琴弦，通过琴马系于下端的木制系弦板上，七条共鸣弦使用钢丝弦，通过琴马直接系于琴底。琴箱底部设有人字形活动支架，琴弓采用小提琴弓。胡西它尔音色柔和，左手技法与艾捷克相近，主要在专业文艺团体中演出十二木卡姆和民族歌舞时所使用。";
	private static String tanbuer = "维吾尔族弦鸣类弹拨乐器。共鸣箱为小瓢形，由整板桑木挖槽而成。上蒙薄平木质面板，面板下部置琴码，上部有新月眉状音孔一对。琴颈细长，上以丝弦缠成品位26个，并嵌以骨质花纹作为装饰。五个琴柱分置于琴柄正面与左侧面，上张钢丝弦五根分为三组；外侧并列的两根是主奏弦，中间一根和内侧并列的两根是伴奏弦。大小形制不一，较大者全长140里面左右。弹布尔一般多为坐姿演奏，右腿放在左腿上，左手持琴斜立，琴头朝向左上方，共鸣箱置于右腿近腹部处。右手腕部接触垫板，手掌接近琴马，击弦点在马子至上方3厘米之间。在北疆和东疆广大地区，将钢丝指拨绑于右手食指第一关节处，即可在主奏弦上单向弹奏，又可在弦上往复弹拨。在南疆则不用钢丝指拨而采用牛角或塑料拨片弹奏。左手以 食指、中指、无名指按弦，拇指奏和弦时也偶尔使用，根据乐曲的需要，可以自由灵活地上下移动、变换把位。演奏技巧丰富多样，右手有弹、强弹、拨、双弹、滚弹、琶弹和扫弹等，左手有平按、拉弦、上下滑音、上下颤音、打音、泛音和揉音等。";
	private static String dutaer = "维吾尔族弦鸣类拨弦乐器。其名称源于波斯语，为“二弦”之意。硕大的半瓢状音箱后壁以桑木薄板条粘接而成，上蒙木质薄板。琴杆偏长，上以丝弦缠成品位十七个，并嵌以骨质花纹作为装饰，两个弦柱各位于琴杆正面及左侧面。琴码置于面板中下部，琴码上方开圆形音孔若干。形制大小不一，全长120厘米左右。演奏时斜抱于身前，共鸣箱置于右腿之上，以右手指拨弦发生，左手按品位改变音高。右手技法有扫、弹、拨、勾、挑，左手技法有揉、压、滑、颤，从而奏出四分音和游移音。都它尔在维吾尔族民间普遍流传，是城乡民众音乐生活最常见的乐器。长自弹自唱，也是“达斯坦”等说唱表演常用的伴奏乐器，或参与乐队为十二木卡姆、吐鲁番木卡姆及民族歌舞伴奏。";
	private static String kashirewapu = "维吾尔族弦鸣类拨弦乐器。又称南疆热瓦普、民间热瓦普，主要流传在南部新疆地区。半球形共鸣箱由整块桑木挖槽而成，上蒙驴、羊或蟒皮。琴杆细长，上以丝弦缠品位20余个，琴杆与音箱的连接部两侧有一对羊角形饰物，共鸣箱外侧及琴杆内、外侧均嵌以骨质花纹作装饰。五至七个琴柱分置于向后弯曲的琴颈两侧，琴身全长130厘米左右。演奏时横抱琴身置于胸前，右手执木质、角质或以化学薄板制成的长蛋形或三角形拨片拨弦发声，左手按品位改变音高。右手技法有弹、拨、滚、扫，左手技法有滑、揉、压、滑、颤、带，从而奏出四分音和游移音。喀什热瓦普是南部新疆伴奏“达斯坦”、“苛夏克”等说唱表演的主要乐器，也经常参与乐队为十二木卡姆及民族歌舞伴奏。";
	private static String yilirewapu = "维吾尔族弦鸣类拨弦乐器。又称改良热瓦普，以喀什热瓦普为基础改良而成。主要流传在北部新疆伊犁地区，并为全新疆各地、县专业歌舞团普遍使用。共鸣箱为稍大的半球形，后壁用薄木板粘拼而成，上蒙驴、羊或蟒皮。琴杆偏短，上嵌金属条作品，五根钢丝分为三组；内侧一根，中间和外侧各以两根为一组。演奏时，不论坐立，身体都要端正，肩部保持平正。将琴横置胸前，共鸣箱放在右肘弯中间，指板朝上。左手虎口托持琴杆、手指按弦取音，右手腕与琴马平齐，拇指与食指执拨片弹弦发音。拨片可用骨片、牛角片、赛璐珞板或木片制成三角形，其中以用0.4厘米左右厚的赛璐珞板制的拨片为佳。左右手技法与喀什热瓦普相近。常参加乐队为十二木卡姆伴奏。";
	private static String kalong = "维吾尔族弦鸣类拨弦乐器。音箱呈扁梯形，状似半张扬琴，琴框桑木、核桃木制，面板、底板松木制。面板中间开一圆形音孔并嵌花朵状音窗，右侧设山口。琴左侧板置拴弦钉，右侧板置调弦钮。面板左、右两侧分别置条码、活动码。张十六或十八组钢丝弦，每组两弦同音。演奏时，琴置于木架或桌上，右手持竹、木制拨片或食指戴指套弹奏，左手持铁制揉弦器（俗称“推抹”）上下按抑或左右移动，产生各种装饰音。右手技巧有单弹、双弹、多弹和快弹等；左手技巧有实音、滑音、颤动音、压弦颤音等。如今已发展为双手各执一拨片，左手兼执揉弦器演奏。卡龙曾广泛流传于南部新疆喀什、和田及刀郎地区，主要用作大型古典套曲十二木卡姆和刀郎木卡姆的伴奏。";
	private static String qiang = "维吾尔族弦鸣类击弦乐器。也译称昌，又称新疆扬琴，流行于新疆维吾尔自治区。形制与汉族的扬琴相同，由共鸣箱、山口、弦轴、弦钉、琴马、琴弦和琴竹等部分构成。琴弦多用铜丝弦，中、高音用裸弦，每音三条弦为一组，常用27号～31号钢丝；低音弦用铜丝弦或钢丝缠弦(裸钢丝外缠以细铜丝) ，一弦一音。演奏时，采用坐姿。将锵置于琴架或桌面上，两手各执一支琴竹分别敲击琴马两侧的琴弦而发音。音域G—a3，达四个八度。常用技巧有揉弦、拨弦、琶音、衬音和八度轮音等，揉弦与汉族扬琴不同，它借鉴了卡龙奏法，一般为压揉。可用于独奏、合奏或伴奏，擅于演奏刚健、欢快、热情奔放的旋律，富有浓郁的民族风格。锵常与弹布尔、卡龙、萨它尔和达卜等维吾尔族传统乐器组合在一起，演奏“十二木卡姆”古典乐曲。";
	private static String naiyi = "维吾尔族气鸣类吹管乐器。横吹者与汉族笛子相近，但无膜孔；竖吹者与西亚、北非地区的奈依相同。管身木制，通常采用当地生长的苹果木、杏木、枣木制作，将木棒掏空为管状。规格尺寸不一，管长40厘米～50厘米不等，管径2.5厘米左右，管身左端开有一个吹孔，不设膜孔，中部开有六个按音孔，管右端开有两个出音孔。在管身左端至吹孔的一段笛腔内，距吹孔0.5左右处堵有笛塞。乃依演奏很有特点：运气较重，口风较紧，音量大小对比强烈，能较好地表现出维吾尔、乌孜别克和 塔吉克等族音乐的风格。多运用颤音、上滑音、下滑音、单倚音和复倚音等演奏技巧。依靠音孔的开闭（包括半音孔的开闭）以及气息控制，能够奏出全部半音及四分音、活音。常用于独奏、民间器乐合奏或为民歌、舞蹈伴奏，在乐队中占有重要位置。";
	private static String sunaiyi = "维吾尔族气鸣类吹管乐器。与汉族唢呐相近，但民间流传者通体以整块木料镟刻而成，为上敛下哆的直管，下端不套金属喇叭口。管身嵌有骨质花纹和宝石等作装饰，上开音孔八至九个。八孔者正面七个，背面一个；九孔者下侧面加开一个。上端插苇片双簧哨头。形制大小不一，全长40厘米左右。发音洪亮，依靠音孔开闭、手指在音孔上的揉动及哨头在嘴唇间的伸缩能够奏出半音、四分音、活音等各种变化音。旋律充满韵味及歌唱性，是欢乐的节日和婚礼喜庆时必不可少的乐器，也是维吾尔族乐队中的旋律乐器，又时还参加小合奏或者担任舞蹈伴奏及民间杂技的伴奏。全疆各维吾尔族聚居区皆为常见。现在维吾尔族民间也使用下端套有用金属喇叭口的苏乃依。以苏乃依吹奏旋律、纳格拉等乐器击节表演十二木卡姆、哈密木卡姆的选段，为群众性自娱舞蹈伴奏，在喀什、和田、阿克苏、伊犁地区和哈密地区均可经常看到。在吐鲁番地区，更可以看到以鼓吹乐队演奏全套吐鲁番木卡姆者。";
	private static String balaman = "维吾尔族吹管乐器。又称皮皮，流行于新疆维吾尔 自治区各地，尤以南疆和田、麦盖提、莎车，东疆鄯善、吐鲁番等地最为盛行。管身苇制，是采用当地生长的一种旱芦苇制作而成，管体质地坚韧，管长28厘米～34厘米，尾端外径1.2厘米、内径0.8厘米，管壁厚0.2厘米。管的上端削薄压扁后成为双簧哨片吹口，簧片 部分 长约4厘米，为使双簧哨片不致变形，簧哨下方还用两根竹片或木片夹住、用绳捆紧，夹片 两端系以红色绸带为饰。所以巴拉曼的上端呈十字形。管身中下部的正面，开有八个正方形 按音孔，各孔长、宽均为0.7厘米，孔距均为1.8厘米。演奏时，管身竖置，双手持握巴拉曼，右手小指、无名指、中指、食指按一、二、三、四孔 ，左手小指、无名指、中指、食指按五、六、七、八孔。口含管首簧片吹奏，用气要均匀、 饱满、连贯。巴拉曼多为民间艺人自制自用，各种调子的都有，口含簧哨深浅不同，也可改 变筒音的音高，演奏不同调子的乐曲。巴拉曼发音明亮，音色 柔和、优美，富有较强的表现力，最擅长演奏抒情性、歌唱性的曲调，常用于独奏“十二木 卡姆”中的散序、器乐间奏曲、民歌或歌舞音乐片断，是维吾尔族、乌孜别克族民间乐队中 最富有特色的吹奏乐器。";
	private static String dapu = "维吾尔族膜鸣类打击乐器。因直接以手敲打而被意译为手鼓。圆形鼓框用桑木制作，框里边装小铁环若干，为增大鼓身晃动时所发出的沙沙声音量，刀郎地区的达普鼓内框还钉有铁片或者铜制大钱；框面蒙驴皮、山羊皮或蟒皮。达普有大、中、小等不同形制，小型达普直径20厘米左右，称作乃格曼达普，是维吾尔族大型古典套曲十二木卡姆的主要击节乐器；中型达普直径40厘米左右，用于为哈密木卡姆击节。演奏时以左手掌托住鼓身，拇指扣住鼓框，其余四指击鼓边或鼓中，右手拇指顶住鼓框或以绳套与鼓框相连，其余四指击鼓边或鼓中，有时亦可以右手掌心击打鼓心。达普为维吾尔族最主要的击打乐器，演奏技巧高超者可以击打出各种复杂的节拍和节奏型。";
	private static String nagela = "维吾尔族膜鸣类打击乐器。因鼓身用铁铸成，故汉族称铁鼓，又有冬巴之称。鼓身用生铁铸造而成(也有铜制)，鼓腔中空，上口较大，下底较小，外形呈花盆状。鼓身两侧各设有一个环耳，以便于搬动时作把手。鼓上口蒙以牛皮、羊皮、驴皮或骆驼羔皮，鼓皮四周由绳索拴系勒紧于鼓身中腰。纳格拉通常大小两个组成一对，鼓面直径，大者25厘米-27.5厘米、小者18厘米-20.5厘米、鼓高20厘米-30厘米。因鼓身和鼓面大小不同，发音高低也有区别，两鼓多定成四度或五度关系。还有一种低音纳格拉鼓，又称冬巴，比小纳格拉的体积大三四倍的大铁鼓，鼓面直径45厘米、鼓高40厘米，可发出浑厚而粗壮的低音。演奏时，把纳格拉鼓平放在地面或台面上，由一人双手各持一根长而稍弯的木棰，右手敲击大鼓，左手敲击小鼓。大鼓发出“咚”的低音，小鼓发出“哒”的高音，音响铿锵、雄厚，音色一高一低，一亮一沉，一飘一落，全在鼓锤之间，舒缓时，如行云漫游，激昂时，如千驹驰骋，组合成天衣无缝美妙绝伦的音乐辐射。";
	private static String sapayi = "维吾尔族体鸣类打击乐器。以野山羊角或两根木棍为把，上面钉有铁皮一块和套有若干小铁环的大铁环两个。演奏时手握羊角或木棍的下部，将其摇动或击手、拍肩，铁环撞击木把上的铁皮即发出有节奏的嚓嚓声。常用作十二木卡姆中麦西热普部分等民间歌舞曲的伴奏，也为阿希克们吟唱麦西热普曲调时所常用，有时又作为道具为男舞蹈演员所持。";
	private static String tashi = "维吾尔族体鸣类打击乐器。采用天然石块而成(图)，石块为扁长形或长圆形，中段稍细，一般长12厘米～14厘米、宽4厘米～6厘米、厚1厘米～1.2厘米，四块为一副。以四周光滑、无棱角的鹅卵石为佳，石质坚硬，不易断裂。演奏时，奏者两手各持两块，掌心朝上，分别用拇指和其他四指夹住，两手同时并用。靠手指开合、晃动，使石块互相拍击作响，可以奏出比较花簇的节奏来，发音短促而清脆。用于民间曲艺和歌舞伴奏，凡弹唱表演中情绪高昂的段落或集体舞蹈中的热烈场面，都要用它石加强节奏。曲艺中多由表演者自击自唱，舞蹈中多由男舞者兼奏。常用于十二木卡姆中麦西热普等欢乐的舞曲伴奏，一些阿希克吟唱麦西热普时也用它石击节伴奏。";
	private static String kuxiuke = "维吾尔族体鸣类打击乐器。意译即为木勺，常以两只长柄木勺组成一组。演奏者以右手握勺柄，以掌、指操纵使之互相撞击或者击打膝、肩、肘等身体的各个部位发声。常用于十二木卡姆中麦西热普部分等欢乐的歌舞曲伴奏，也可作为男舞蹈演员的手持道具。";
	
	public static String[] INSTRODUCES = {
		sataer,aijieke,huxitaer,tanbuer,dutaer,kashirewapu,yilirewapu,
		kalong,qiang,naiyi,sunaiyi,balaman,dapu,nagela,sapayi,tashi,kuxiuke
	};
}
